
import NeuroDocumentSorter

text = '''
Образование:
В области образования правительство провело ряд кардинальных реформ. В 1871
году было создано Министерство культуры, центральное учреждение, отвечавшее за
образовательную политику. В 1872 году оно издало постановление о системе
государственного образования по французскому образцу. Согласно этой системе
Япония
была разделена на 8 университетских округов. Каждый округ мог иметь 1 университет
и
32 средние школы. Каждая средняя школа образовывала отдельный район средней
школы,
в котором должно было работать 210 начальных школ. Однако постановление
Министерства было скорее декларативным и не учитывало реальных возможностей
педагогов и граждан. Поэтому в 1879 году Министерство издало «Указ об
образовании»,
по которому система округов отменялась, а обязательное государственное
образование
ограничивалось лишь начальной школой немецкого образца. Впервые появились
государственные учебные заведения, где мальчики и девочки учились вместе.
Государство также прилагало усилия для развития японского университетского
образования. В частности, в 1877 году был основан Токийский университет, в котором
по
приглашению японского правительства работало много иностранных специалистов. В
префектурах были созданы педагогические институты и высшие учебные заведения
для
женщин. Государственная инициатива была поддержана общественными деятелями.
Так,
Фукудзава Юкити стал учредителем частной школы Кэйо, будущего университета
Кэйо, а
'''

NeuroDocumentSorter.sort_document(text)